In [2]:
import pandas as pd
import numpy as np

In [17]:
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### shape : 열과 행의 개수 알아보기

In [8]:
titanic_df.shape

(891, 12)

### info() : 열과 행 개수, 칼럼의 타입, null 데이터 개수, 데이터 분포도 등 메타데이터 조회

In [10]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### describe() : 숫자형 데이터 값의 평균값, 최소/최대, n-percentile 분포

In [11]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

Survived, Pclass, Parch, SibSp는 숫자형 카테고리 칼럼임 -> 평균값, 최대/최소 의미없음

### Series : 칼럼을 한 개 가진 데이터 구조체
### index : 개별 데이터를 고유하게 식별하는 key

In [16]:
titanic_sibsp = titanic_df["SibSp"]
print(type(titanic_sibsp))
titanic_sibsp

<class 'pandas.core.series.Series'>

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    1
889    0
890    0
Name: SibSp, Length: 891, dtype: int64

### value_counts() : 컬럼값의 유형과 건수 확인 가능

In [ ]:
print(type(titanic_sibsp.value_counts()))
titanic_sibsp.value_counts()

# DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호변환

### 리스트, 딕셔너리, 넘파이 ndarray -> DataFrame

- 1차원 데이터 변환하기

In [3]:
# 1개의 컬럼명 필요
col_name = ["col1"]
# 1차원 리스트와 ndarray
list1 = [1,2,3]
array1 = np.array(list1)

# 리스트->데이터프레임
df_list1 = pd.DataFrame(list1, columns = col_name)
print(type(df_list1))
print("1차원 리스트로 만든 데이터프레임:\n",df_list1)

# ndarray->데이터프레임
df_array1 = pd.DataFrame(array1, columns = col_name)
print(type(df_array1))
print("1차원 ndarray로 만든 데이터프레임:\n",df_array1)

<class 'pandas.core.frame.DataFrame'>
1차원 리스트로 만든 데이터프레임:
    col1
0     1
1     2
2     3
<class 'pandas.core.frame.DataFrame'>
1차원 ndarray로 만든 데이터프레임:
    col1
0     1
1     2
2     3

- 2차원 이상 데이터 변환하기

In [3]:
# 3개의 데이터 필요 
col_name = ["col1","col2","col3"]
# 2차원(2행 3열) 리스트와 ndarray
list2 = [[1,2,3],[4,5,6]]
array2 = np.array(list2)

# 리스트->데이터프레임
df_list2 = pd.DataFrame(list2, columns = col_name)
print(type(df_list2))
print("2차원 리스트로 만든 데이터프레임:\n",df_list2)

#ndarray->데이터프레임
df_array2 = pd.DataFrame(array2, columns = col_name)
print(type(df_array2))
print("2차원 ndarray로 만든 데이터프레임:\n",df_array2)

<class 'pandas.core.frame.DataFrame'>
2차원 리스트로 만든 데이터프레임:
    col1  col2  col3
0     1     2     3
1     4     5     6
<class 'pandas.core.frame.DataFrame'>
2차원 ndarray로 만든 데이터프레임:
    col1  col2  col3
0     1     2     3
1     4     5     6

- 딕셔너리 -> 데이터프레임

In [5]:
# 딕셔너리의 key는 컬럼명으로,  딕셔너리의 value는 키에 해당하는 칼럼데이터로 변환
dict1 = {"col1":[1,11], "col2":[2,22],"col3":[3,33]} 
df_dict1 = pd.DataFrame(dict1)
print("딕셔너리로 만든 데이터프레임:\n", df_dict1)

딕셔너리로 만든 데이터프레임:
    col1  col2  col3
0     1     2     3
1    11    22    33

### DataFrame -> 리스트, 딕셔너리, 넘파이 ndarray

- DataFrame -> ndarray : values 이용

In [7]:
array3 = df_dict1.values
print(type(array3))
print(array3)

<class 'numpy.ndarray'>
[[ 1  2  3]
 [11 22 33]]

- DataFrame -> 리스트

In [9]:
list3 = df_dict1.values.tolist() #ndarray를 리스트로 변환한다.
print(type(list3))
print(list3)

<class 'list'>
[[1, 2, 3], [11, 22, 33]]

- DataFrame -> 딕셔너리 : to_dict() 메서드 사용

In [14]:
dict3 = df_dict1.to_dict('list') #딕셔너리의 value가 리스트형으로 반환됨
print(type(dict3))
print(dict3)

<class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

# DataFrame의 칼럼 데이터 세트 생성과 수정

- 생성

In [22]:
titanic_df["Age_0"] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [23]:
titanic_df["Age_by_10"] = titanic_df["Age"]*10
titanic_df["Family_No"] = titanic_df["SibSp"]+titanic_df["Parch"]+1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

- 수정

In [24]:
titanic_df["Age_by_10"] = titanic_df["Age_by_10"]+10
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,230.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,390.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,270.0,1

# DataFrame 데이터 삭제 : drop()

- 로우(행) 드롭 : axis = 0

In [25]:
titanic_df = titanic_df.drop([0,1,2], axis= 0)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,360.0,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,360.0,1
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,0,NaN,1

- 칼럼(열) 드롭

In [26]:
# inplace=False가 default, 반환값 있음
titanic_df = titanic_df.drop("Age_0", axis = 1)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,360.0,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,360.0,1
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,NaN,1

In [27]:
# inplace=True, 반환값 없음
titanic_df.drop(["Age_by_10","Family_No"], axis = 1, inplace=True)
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

# Index 객체

In [28]:
titanic_df = pd.read_csv("titanic_train.csv")

In [29]:
indexes = titanic_df.index
print(indexes)

RangeIndex(start=0, stop=891, step=1)

In [31]:
print(type(indexes.values))
print("Index 객체 array 값:\n",indexes.values) #1차원 ndarray

<class 'numpy.ndarray'>
Index 객체 array 값:
 [  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [32]:
indexes[0] = 5 #index 객체 변경 불가능

TypeError: Index does not support mutable operations

- reset_index() : 새롭게 인덱스를 연속 숫자형으로 할당

In [33]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [40]:
titanic_pclass = titanic_df["Pclass"].value_counts()
print(type(titanic_pclass))
print(titanic_pclass)
# 이렇게 인덱스가 연속된 숫자형이 아닐 때 reset_index() 사용

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

In [41]:
titanic_pclass = titanic_pclass.reset_index(inplace=False)
titanic_pclass

   index  Pclass
0      3     491
1      1     216
2      2     184

# 판다스 데이터 컬렉션과 필터링

DataFrame 뒤의 [] : 칼럼지정 연산자

In [3]:
data = {'Name': ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
        'Year': [2011, 2016, 2015, 2015],
        'Gender': ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one','two','three','four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

### iloc[] : 위치기반 인덱싱 
- 행과 열의 위치 좌표

In [4]:
data_df.iloc[0,0] #integer 또는 integer형의 슬라이싱, 팬시 리스트 값 입력

'Chulmin'

In [5]:
data_df.iloc[0,"Name"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

### loc[] : 명칭 기반 인덱싱 
- DataFrame의 인덱스나 칼럼명

In [7]:
data_df.loc["one","Name"]

'Chulmin'

In [8]:
data_df.loc{0,"Name"}

SyntaxError: invalid syntax (<ipython-input-8-b4d2eff4a62e>, line 1)

In [9]:
data_df_reset = data_df.reset_index()
data_df_reset.index = data_df_reset.index+1
data_df_reset

   index      Name  Year  Gender
1    one   Chulmin  2011    Male
2    two  Eunkyung  2016  Female
3  three  Jinwoong  2015    Male
4   four   Soobeom  2015    Male

In [12]:
data_df_reset.loc[1,"Year"] 
# DataFrame의 인덱스가 숫자형일 경우, 행 위치에 오는 숫자는 
# 위치 기반 인덱싱이 아니라 명칭 기반 인덱싱의 DataFrame의 인덱스를 가리킵니다.

2011

In [10]:
data_df_reset.loc[0,"Year"]

KeyError: 0

- 위치 기반 인덱싱에서의 슬라이싱 = '시작점:종료점+1'
- 명칭 기반 인덱싱에서의 슬라이싱 = '시작점:종료점'

In [13]:
data_df_reset.iloc[0:2,0:2]

  index      Name
1   one   Chulmin
2   two  Eunkyung

In [14]:
data_df_reset.loc[1:2,"index":"Name"]

  index      Name
1   one   Chulmin
2   two  Eunkyung

### 불린 인덱싱

In [18]:
titanic_boolean = titanic_df[titanic_df["Age"]>60]
print(type(titanic_boolean))
titanic_boolean.head(3)

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C

In [19]:
titanic_df[titanic_df["Age"]>60][["Name","Age"]].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [21]:
titanic_df.loc[titanic_df["Age"]>60, ["Name","Age"]].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [23]:
titanic_df[(titanic_df["Age"]>60)&(titanic_df["Pclass"]==1)&(titanic_df["Sex"]=="female")]
# 복합 조건 연산자 사용

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

# 정렬, Aggregation 함수, GroupBy 적용

### 정렬 : sort_values(by, ascending, inplace)

In [25]:
titanic_sorted = titanic_df.sort_values(by="Age", ascending=False)
titanic_sorted.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

In [26]:
titanic_sorted = titanic_df.sort_values(by=["Name","Age"])
titanic_sorted.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S
308,309,0,2,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.00,NaN,C
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.00,NaN,C

### Aggregation 함수 : min(), max(), sum(), count()

In [27]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [28]:
titanic_df[["Age","Pclass"]].mean()

Age       29.699118
Pclass     2.308642
dtype: float64

### GroupBy(by)

In [29]:
titanic_groupby= titanic_df.groupby(by="Pclass")
type(titanic_groupby)

pandas.core.groupby.generic.DataFrameGroupBy

In [32]:
# groupby 적용 후 Aggregation 함수 호출
titanic_groupby.count()

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

In [33]:
# groupby 적용 후 특정 칼럼에 여러 개의 Agrgregation 함수 호출
titanic_df.groupby("Pclass")["Age"].agg(["max","min"])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [34]:
# aggregation 적용할 칼럼과 함수를 딕셔너리 형태로 만들어 입력 -> 유연하게 작업 가능
agg_format = {"Age":"max","SibSp":"sum","Fare":"mean"}
titanic_df.groupby("Pclass").agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550